{"title":"Biography","layout":1,"infoBox":{"image":"zack-wilson.jpg","data":{"Name":"Zack Wilson","Aliases":"DragonZBW, Zack of All Trades","Pronouns":"He/Him","Age":"24","Alma Mater":"RIT","Degree":"B.S. in Game Design & Development, summa cum laude","Favorite Game":"Xenoblade","Favorite Band":"OK Goodnight","Favorite Anime":"Gurren Lagann"}},"text":[{"heading":"About Me","paragraphs":["I'm Zack Wilson, an American game developer and musician, among other things. I grew up with an early interest in computers, storytelling, and game design, often creating my own rules for board games when playing with my parents. Over time, my creative interests turned into things I wanted to seriously pursue, so I began learning about programming, game design, music, and so on.","I love action movies, stylized animation, philosophy, cool characters with big swords, and colorful games that are fun to control! My dream is to become creative director of a larger-scale character action game or RPG one day, but for now I'm doing whatever I can to keep honing my skills."]},{"heading":"Education & Extracurriculars","paragraphs":["I attended the Advanced Academics Program at my elementary school, later taking honors and AP courses in middle and high school. I was accepted to the Game Design and Development program at the Rochester Institute of Technology and graduated [i : summa cum laude] in the Fall semester of 2023.","Prior to college, I engaged in many extracurricular activities such as orchestra, FIRST LEGO League, and a game development club, of which I was president. Throughout college I spent most of my time outside of class working part-time jobs, developing personal projects, or working on music for the two bands I joined."]},{"heading":"Career","paragraphs":["Most recently, I worked on [Raw Metal : #games.raw-metal], my first commercial game. I worked in a small team as the programmer/composer on the project and also contributed a bit to some other aspects of development. The game released on March 19th, 2024, after about two years of development, to positive reception on Steam and has sold over 6,500 units as of July 2024. I am working on bug-fixes for the game as well as a set of improvements that we plan to release over the next four to six months.","I've worked a few jobs as a teaching assistant for college courses in game design and development taught in C# – one using MonoGame and one using Unity. I also worked as a lab technician at RIT's Interactive Games and Media computer labs, helping other students with code and other technical issues."]},{"heading":"Accomplishments & Accolades","paragraphs":["- PAX Rising Showcaser, for [Raw Metal : #games.raw-metal]","- Gold Medal, Scholastic Art & Writing awards, for [Delta A.R.C. : #games.delta-arc]"]}],"gallery":[{"name":"Nest","shortDesc":"Animated Film Character Design","includeInSlideshow":false,"slideshowImg":"","previewImg":"preview-nest.png","videoURL":"https://www.youtube.com/embed/jzGA5YSziLk?si=aidhuoSiVauD7Yh7","linkURL":"","linkTitle":"","text":[{"heading":"","paragraphs":["I drew two character designs and some prop designs for my friend Corrigan's short animated film Nest. In addition to creating the [music : #music.nest], I was asked to assist with character concept work.","The first design was the spear-wielding main character of the film. I partially based this reference design off of a previous iteration that was made by the project's other character designer. I figured that a tank top and tied-up hair would make sense for this character, since she's out in the wild and wouldn't want to be wearing anything too heavy or hot, and needs to be able to see and move around easily. She is in a forested, sort of jungle-ish area, though, so long pants and boots made sense for protection from things like brambles and animals. Of course, she has some extra pouches for storage and some accessories for added style. The blue accents in her hair, belt, gloves, and sports bra act as a sort of color theming to go with the bow-wielder's green theming and are based on how these characters were originally referred to as \"Blue\" and \"Green\" in early documents.","[img : nest-girl.png, fill]","I also designed equipment for the raiders that appear in the film. I was asked to create a military-esque coverall outfit based on fighter pilot equipment. I also designed some weapons for the raiders to use. I tried to find a good balance between realism and slightly sci-fi designs for the guns.","[img : nest-raider.png, fill]","To add some variety and distinguish the raiders, I designed a few pieces of interchangeable equipment for them, including different masks, helmets, and body wear. I was asked originally to design some body armor for them, but as body armor would typically be worn underneath coveralls, the armor design ended up more light, with only a makeshift pauldron and some elbow and knee pads.","[img : nest-raider-equip.png, fill]"]}],"infoBox":{"image":"","data":{"Type":"Character/Prop Concept","Software":"Photoshop","Time Frame":"February-March 2024"}}},{"name":"Raw Metal","shortDesc":"Game Environment Concept Art","includeInSlideshow":false,"slideshowImg":"","previewImg":"preview-rm.png","videoURL":"https://www.youtube.com/embed/WY8ua4s1_uE?si=na3qvzFxkESzX0-3","linkURL":"https://store.steampowered.com/app/2279600/Raw_Metal/","linkTitle":"Steam Page w/Demo","text":[{"heading":"","paragraphs":["During the development of Raw Metal, aside from [coding : #games.raw-metal] and creating [music : #music.raw-metal], I was also tasked with creating concept art for the environments in the game. In pre-production, I worked in a collaborative canvas program with the rest of the team to create tentative color palettes and mood boards for each level. Some of these would be scrapped or changed later on, but much of this initial brainstorming was useful for determining the general mood of each area."]},{"heading":"Underground","paragraphs":["The first area I designed was the game's first underground layer, the Upper Crust. In the game, you are delving into an off-world mining facility, and this is where the majority of the mining operation is actually taking place. Because of this, I drew various objects and equipment you might find in this sort of facility – drills, generators, and so on. You can see some notes I made for our technical artist – I didn't have time to design every single prop in the game, so he was given some freedom to design his own objects as well. In order to preserve cohesion between his designs and mine, I included notes on the shape language and color palette.","[img : rm-concept-l1.png, fill]","Here is a concept I did for a hydraulic press that appears in this area. I enjoyed working on the more mechanical designs, as it was something I hadn't tried much before. I tried to strike a balance between real-world machines and sci-fi nonsense.","[img: rm-concept-hydraulic.png, fill]","The game's second underground layer was originally split into two separate layers, a crystal cave and a sort of jungley area with vines. We decided that due to our large scope, we would decrease the number of levels by combining those two areas. Here you can see an early concept for the crystal caves:","[img: rm-concept-l2-scrapped.png, fill]","And here is the final version. You can see how I revised existing concepts and combined the idea of the crystal caves with a more organic plant-life-filled area.","[img: rm-concept-l2.png, fill]","On the third layer of the facility, things take a drastic turn for the sterile. It becomes clear to the player that this isn't just a mining operation – it's also a testing facility for mysterious high-tech weaponry. To create a strong juxtaposition between the previous areas and this one, I went with a stark white, grey, and orange color palette and created a littany of new props such as corporate desks, shooting targets, display cases, and weapons. I also designed some special rooms such as an open circular hallway with suspended catwalks you can launch enemies off of and a giant open area with a levitating machine. This was one of the most taxing (but fun) areas to design, as I had to consider the minutia of how various walkways and objects would connect.","[img: rm-concept-l3.png, fill]","The 3rd layer's boss arena had some notable elements such as unique props and a wooden floor. This is probably the single greatest amount of wood gathered in one place on the planet the game is set on. I used screenshots of the main character's 3D model to correctly convey the scale of the rooms.","[img: rm-concept-l3b.png, fill]","Here is the third boss herself. I didn't technically design this character, rather I drew reference art for our technical artist based off an existing sketch the game's director made.","[img: rm-concept-b3.png, fill]"]},{"heading":"The Surface","paragraphs":["The main character's hideout is on the surface of the planet in an abandoned excavator. The hideout is visible from a few angles during the game, so I designed the interior and exterior. Designing the excavator itself was a challenge, with all its mechanical parts. I also had to work to make the interior look interesting. Our director requested some revisions on it such as raising certain parts of the floor, which you can see in the final game.","[img: rm-concept-hideout-ext.png, fill]","[img: rm-concept-hideout-int.png, fill]"]},{"heading":"Gear","paragraphs":["In Raw Metal, the player can find and equip over 50 unique pieces of gear that provide special effects. Every piece of gear has a unique design and in-game appearance, so I had to draw reference art for each one. Most of the gear pieces had rough designs by our director, Corrigan, but I designed some of them myself as well, including a couple of the head, chest, and arm designs, and most of the leg designs. Since there are so many pieces, I've selected some of my favorites to show here rather than including all of them.","[img: rm-concept-gear.png, fill]"]}],"infoBox":{"image":"","data":{"Type":"Environment/Prop/Character Concept","Software":"Photoshop","Time Frame":"2022-2023"}}},{"name":"Etho's Escape","shortDesc":"Animated Short Film","includeInSlideshow":false,"slideshowImg":"","previewImg":"preview-ethos.png","videoURL":"https://www.youtube.com/embed/wj96RwbikG4?si=j4G9c6YbgNbsIqxh","linkURL":"","linkTitle":"","text":[{"heading":"","paragraphs":["Etho's Escape is a short 2D animated film I created that was started as part of a high school Digital Art class and finished on my own time. I started by coming up with a general idea and concept art for the characters, then made a storyboard on paper (that was a requirement for the class – if I had my way I probably would have storyboarded in the animation software). Then, I used Adobe Animate to create the rest of the animation. I employed both hand-drawn frames and some auto-tweened graphics, and used some layer effects to create a glow on certain elements. There is some (admittedly kind of bad) rotoscoping at one point as well. I made the music myself, too.","I received an award at the Herndon Technology Arts Exhibit for Etho's Escape in 2019."]}],"infoBox":{"image":"","data":{"Type":"2D Animation","Software":"Photoshop, Animate","Time Frame":"2017-2018"}}}]}