{"title":"Art","layout":2,"infoBox":{"image":"","data":{}},"text":[{"heading":"Background","paragraphs":[]}],"gallery":[{"name":"Nest","shortDesc":"Animated Film Character Design","includeInSlideshow":false,"slideshowImg":"","previewImg":"","videoURL":"https://www.youtube.com/embed/jzGA5YSziLk?si=aidhuoSiVauD7Yh7","linkURL":"","linkTitle":"","text":[{"heading":"","paragraphs":["I drew two character designs and some prop designs for my friend Corrigan's short animated film Nest. In addition to creating the [music : #music.nest], I was asked to assist with character concept work.","The first design was the spear-wielding main character of the film. I partially based this reference design off of a previous iteration that was made by the project's other character designer. I figured that a tank top and tied-up hair would make sense for this character, since she's out in the wild and wouldn't want to be wearing anything too heavy or hot, and needs to be able to see and move around easily. She is in a forested, sort of jungle-ish area, though, so long pants and boots made sense for protection from things like brambles and animals. Of course, she has some extra pouches for storage and some accessories for added style. The blue accents in her hair, belt, gloves, and sports bra act as a sort of color theming to go with the bow-wielder's green theming and are based on how these characters were originally referred to as \"Blue\" and \"Green\" in early documents.","[img : nest-girl.png, fill]","I also designed equipment for the raiders that appear in the film. I was asked to create a military-esque coverall outfit based on fighter pilot equipment. I also designed some weapons for the raiders to use. I tried to find a good balance between realism and slightly sci-fi designs for the guns.","[img : nest-raider.png, fill]","To add some variety and distinguish the raiders, I designed a few pieces of interchangeable equipment for them, including different masks, helmets, and body wear. I was asked originally to design some body armor for them, but as body armor would typically be worn underneath coveralls, the armor design ended up more light, with only a makeshift pauldron and some elbow and knee pads.","[img : nest-raider-eqiup.png, fill]"]}],"infoBox":{"image":"","data":{}}},{"name":"Raw Metal","shortDesc":"Game Environment Concept Art","includeInSlideshow":false,"slideshowImg":"","previewImg":"","videoURL":"","linkURL":"","linkTitle":"","text":[{"heading":"","paragraphs":[]}],"infoBox":{"image":"","data":{}}},{"name":"Etho's Escape","shortDesc":"Animated Short Film","includeInSlideshow":false,"slideshowImg":"","previewImg":"","videoURL":"https://www.youtube.com/watch?v=wj96RwbikG4","linkURL":"","linkTitle":"","text":[{"heading":"","paragraphs":["Etho's Escape is a short 2D animated film I created that was started as part of a high school Digital Art class and finished on my own time. I started by coming up with a general idea and concept art for the characters, then made a storyboard on paper (that was a requirement for the class – if I had my way I probably would have storyboarded in the animation software). Then, I used Adobe Animate to create the rest of the animation. I employed both hand-drawn frames and some auto-tweened graphics, and used some layer effects to create a glow on certain elements. There is some (admittedly kind of bad) rotoscoping at one point as well. I made the music myself, too.","I received an award at the Herndon Technology Arts Exhibit for Etho's Escape in 2019."]}],"infoBox":{"image":"","data":{}}}]}