{"title":"Music","layout":2,"infoBox":{"image":"N/A","data":{}},"text":[{"heading":"Background","paragraphs":["My parents are both musicians, so it's no surprise I got into music as well. In elementary school, I started messing around in GarageBand – just sequencing loops together and calling it my own music – and also started taking piano and cello lessons. I played cello in my school orchestra until my senior year of high school, and though I stopped playing piano due to stress and a lack of interest in classical music, I got back into it in high school because I wanted to play songs from my favorite games and anime. I also learned guitar and ukulele and started to seriously get into songwriting in high school.","In college, I joined two bands, Plus One and PNKY PKN, in which I played keyboard. I also have put out a decent amount of music on my own, including a small EP, soundtracks for a few games, and some background music for YouTube.","I enjoy experimenting with a wide range of genres, including jungle/DnB, trance, house, funk, jazz fusion, rock, and metal and draw influences from a variety of artists as well. Some of my favorites are Hiroyuki Sawano (Attack on Titan, Xenoblade X), OK Goodnight, Lost Horizon, Chronologist, Ben Folds, Dave Weckl, and Casiopea."]}],"gallery":[{"name":"Nest","shortDesc":"Short Film Soundtrack","includeInSlideshow":false,"slideshowImg":"","previewImg":"preview-nest.png","videoURL":"https://www.youtube.com/embed/jzGA5YSziLk?si=aidhuoSiVauD7Yh7","linkURL":"","linkTitle":"","text":[{"heading":"","paragraphs":["I composed the music for my friend Corrigan's college capstone film project Nest. We had previously worked together on [Raw Metal : #games.raw-metal] and some other minor personal projects, so I had some experience working with him and composing music for projects of his. He gave me a general idea of the type of music he was envisioning (a hardcore song incorporating both synths and acoustic/traditional instruments to represent both the futuristic wasteland and natural scenery and characters) and I wrote and recorded something timed out to the rough cut of the film. I was also asked to make some adjustments here, such as including a more prominent stinger when the bow wielder first attacks the raiders and toning down the intensity on the drums and bass, which originally were stronger and in a distorted hardcore EDM style. As with Raw Metal, I enjoyed composing and timing music to an animation and found enjoyment in the challenges of instrumentating and composing something to properly fit the scene being depicted."]}],"infoBox":{"image":"","data":{"Genre":"Folk/Electronic/Dance","Software":"Logic Pro X","Instruments":"Keyboard"}}},{"name":"Raw Metal","shortDesc":"Rock/DnB Game Soundtrack","includeInSlideshow":false,"slideshowImg":"","previewImg":"preview-rm.png","videoURL":"https://www.youtube.com/embed/videoseries?si=25RrWpP0MIGtf8bu&amp;list=PLSLsB9wTDpMbOJkC7VrgIJ3rmFsz03UwK","linkURL":"https://store.steampowered.com/app/2279600/Raw_Metal/","linkTitle":"Steam Page w/Demo","text":[{"heading":"","paragraphs":["[Raw Metal : #games.raw-metal] is a game I helped make along with some friends of mine. In addition to coding the game and providing some [concept art : art.raw-metal], I composed and recorded the game's soundtrack. The lead designer provided some reference for the general style of music to go for, and I went off of that when composing. I took inspiration from a variety of sources, namely Xenoblade X and Vertigo as well as some prog rock bands such as OK Goodnight and Chronologist. For this project, I created dynamic music – each song has multiple parts that are transitioned between depending on the game state. For instance, the standard level songs have a stealth, pursuit, and combat section. The boss songs have an intro, phase 1, phase transition, phase 2, and outro section. I especially enjoyed working on the boss songs because I got to time the music with the intro/phase transition cutscenes. I think I did an especially good job with this in the music for the third boss, which gets very dramatic in those cutscenes. Similarly to my work on [UpRooted : #music.uprooted], I worked with feedback to adjust songs where necessary. This is also one of the only music projects I've worked on where some of the drums were actually recorded on a real (electronic) drum set (although I think I only did that for one or two songs, as I'm pretty new to drumming and am a bit more comfortable programming drum patterns on a keyboard)."]}],"infoBox":{"image":"","data":{"Genre":"Rock/DnB","Software":"Logic Pro X","Instruments":"Keyboard, Guitar, Drums"}}},{"name":"Studio PolyGroup","shortDesc":"YouTube Channel Soundtrack","includeInSlideshow":false,"slideshowImg":"","previewImg":"preview-polygroup.png","videoURL":"https://www.youtube.com/embed/videoseries?si=ooFpGUTSsHdYSTSz&amp;list=PL3wo7yv14vnoxqWra3VkoDjnZ7Bw0yf_g","linkURL":"","linkTitle":"","text":[{"heading":"","paragraphs":["Studio PolyGroup is a YouTube channel run by some friends of mine that offers short, fun tutorials about 3D asset creation (modeling, animation, etc.). They asked me to create some background music for their shorts, so I made a few tracks. I was provided with some reference songs and used those to write music I thought would fit well with their content, exploring a variety of moods to prevent the audio of different videos on the channel from becoming too repetitive. I took inspiration not only from the provided reference but also from future funk, lo-fi, and 90s dance songs I enjoyed. I employed some custom synth sounds on these tracks that I made with Logic Pro's stock Alchemy plugin."]}],"infoBox":{"image":"","data":{"Genre":"LoFi/Dance","Software":"Logic Pro X","Instruments":"Keyboard, Guitar"}}},{"name":"The Marked","shortDesc":"Atmospheric Game Soundtrack","includeInSlideshow":false,"slideshowImg":"","previewImg":"preview-marked.png","videoURL":"https://www.youtube.com/embed/videoseries?si=hqSv7ybEOqqEJcFs&amp;list=PL3wo7yv14vnryVSEQlUDVspBTSHGVNxRI","linkURL":"https://people.rit.edu/zbw5667/529/themarked/","linkTitle":"Play in Browser","text":[{"heading":"","paragraphs":["[The Marked : #games.the-marked] is a short visual novel game I made. I also composed and recorded the music for it. The soundtrack for the game was inspired by other visual novels such as Steins;Gate and Umineko, and was intended to have a sort of chill \"hanging out\" vibe for the most part. Of course, some scenes require more tense music to fit the mood, so the music in those parts was created accordingly. It's hard to classify the genre for this game's music, but I was originally going for something midwest emo-ish and sort of ambient. Personally, my favorite track is probably \"quelle\" – I think I got a lot of mileage out of just moving the same riff around over and over. It creates kind of a cyclical, mysterious feeling which matches the character of Quelle."]}],"infoBox":{"image":"","data":{"Genre":"Various","Software":"Logic Pro X","Instruments":"Keyboard, Guitar"}}},{"name":"Rise By Night","shortDesc":"Spooky EP","includeInSlideshow":false,"slideshowImg":"","previewImg":"preview-rise-by-night.png","videoURL":"https://www.youtube.com/embed/videoseries?si=GGkEq2LTE78KkAU5&amp;list=PL3wo7yv14vnokyyXLxj93Hym-s25ENVGI","linkURL":"","linkTitle":"","text":[{"heading":"","paragraphs":["Rise By Night is a short EP I made for Halloween 2023. I love the so-called \"spooky season,\" so I thought it would be fun to put together some themed music for it. The songs are largely in a rock/funk style with certain elements included to give them a spooky vibe, such as a church organ or the marimba to evoke the sound of a skeleton's bones. The final track, Dry Autumn Sunset, has a very different sound as more of a chill lo-fi piano track. I wanted to create a song that captured the feeling of watching the orange leaves fall as the sun went down, so I tried to make it very relaxing. I didn't spend much time on this EP, but I think it turned out well since I avoided overthinking or over-producing it. This EP also marks the start of me getting better at mastering my music. I don't think I ever used a limiter before this project..."]}],"infoBox":{"image":"","data":{"Genre":"Rock/Funk/LoFi","Software":"Logic Pro X","Instruments":"Keyboard, Guitar"}}},{"name":"Plus One","shortDesc":"Funk/Pop Cover Band","includeInSlideshow":false,"slideshowImg":"","previewImg":"preview-plus1.jpg","videoURL":"https://www.youtube.com/embed/videoseries?si=aU5EhbG-N3FCxjEI&amp;list=PLqOwSx5qmye1AwVaDx5HnDoJHvP7ISsZ9","linkURL":"","linkTitle":"","text":[{"heading":"","paragraphs":["Plus One is a cover band I was part of in college. We performed covers of popular pop, funk, and rock songs, as well as some lesser-known songs that band members wanted to cover. We performed at many events both on and off-campus and did our own sound. I mostly played keyboard in this band, and learned most of our songs through a combination of online chord charts and my own ear. I also played guitar briefly when we played Larnell Lewis' song Rejoice. Learning and playing music in a group was a great experience for me. I had been in orchestra previously but had not yet had the experience of being in a student-led band playing more popular styles of music. Being in this band is also a large part of what got me into jazz fusion, as the other band members were interested in it. We covered Snarky Puppy's Lingus and a few Dave Weckl songs, which I really enjoyed. "]}],"infoBox":{"image":"","data":{"Genre":"Funk/Pop/Rock","Software":"N/A","Instruments":"Keyboard, Guitar"}}},{"name":"PNKY PKN","shortDesc":"Original Jazz Fusion Band","includeInSlideshow":false,"slideshowImg":"","previewImg":"preview-pnky.jpg","videoURL":"https://www.youtube.com/embed/?listType=playlist&list=PL5YrjjNxqbQUIU2dz_6CN2PjzToGZBCLs&si=LyK8bPeB08lZonub","linkURL":"","linkTitle":"","text":[{"heading":"","paragraphs":["PNKY PKN is a jazz fusion band I was a part of in college. Our focus was on playing original compositions, especially those incorporating jazz fusion with vocals. I played keyboard in the band and composed multiple songs for us, although we only ever performed one publicly, titled Tsunami. Being part of this group was a lot of fun. Working on original songs and collaborating with the other band members to make each song as good as it could be was a great experience. I also had to get back into reading sheet music (something I hadn't done much for the past few years) to learn the songs that the other band members wrote."]}],"infoBox":{"image":"","data":{"Genre":"Jazz Fusion","Software":"MuseScore","Instruments":"Keyboard"}}},{"name":"UpRooted","shortDesc":"RPG Game Soundtrack","includeInSlideshow":false,"slideshowImg":"","previewImg":"preview-uprooted.jpg","videoURL":"https://www.youtube.com/embed/videoseries?si=yg3apDI7FP-5gFlB&amp;list=PL3wo7yv14vnqedyEU5UdgSFQ5t3z5cfVl","linkURL":"https://store.steampowered.com/app/1988330/UpRooted/","linkTitle":"Steam Page w/Demo","text":[{"heading":"","paragraphs":["[UpRooted : https://dragonzbw.github.io/] is an in-development RPG for which I am composing music and making sound effects. For this project, I was asked to create something Studio Ghibli-esque while incorporating my own stylistic choices to match the game's environments/scenes/battles – the game revolves around a glitchy, corrupted forest, so many of the tracks incorporate both folky instruments and synths. I have composed a few tracks for this game, and have worked with the team to respond to feedback and make adjustments."]}],"infoBox":{"image":"","data":{"Genre":"Various","Software":"Logic Pro X","Instruments":"Keyboard, Guitar"}}}]}